
""" 테트리스블럭안의합최대화하기 / 20260916 / 체감 난이도: 실버
소요 시간 30분 / 시도 2회 / 실행 시간 80ms (코드트리) / 메모리 18MB (코드트리)

사실 기억이 나버렸다. 종협이 했던 풀이가..
그래서 상대좌표 써서 풀어보진 않았기 때문에 그 풀이로 해봤다.
문제에서 '뒤집을 수 있다' 라고 한 거를 봤음에도 불구하고 빼먹은 모양이 있어서 한 번 틀렸다.
(뒤집어서 나오는 모양 4개 빠뜨림)
과거의 나는 백트래킹으로 풀었던데, 백트래킹 생각해낸게 대단하다.
시간나면 백트래킹도 다시 도전을..

"""

def in_range(nr, nc):
    return 0<=nr<R and 0<=nc<C

# ==============
R, C = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(R)]

# 블록 15개 전부 다 써줄게
block = [[(0,0), (0,1), (0,2), (0,3)],  # ㅡ
         [(0,0), (1,0), (2,0), (3,0)],  # ㅣ
         [(0,0), (1,0), (0,1), (1,1)],  # ㅁ
         [(0,0), (1,0), (2,0), (2,1)],  # ㄴ
         [(0,0), (0,1), (0,2), (1,2)],  # ㄱ
         [(0,0), (1,0), (2,0), (2,-1)], # 아.. 여기서부터 한글로 표현 불가
         [(0,0), (1,0), (1,1), (1,2)],  # ㄴ
         [(0,0), (1,0), (1,1), (2,1)],
         [(0,0), (0,1), (-1,1), (-1,2)],
         [(0,0), (1,0), (1,1), (2,0)],  # ㅏ
         [(0,0), (1,-1), (1,0), (1,1)], # ㅗ
         [(0,0), (1,0), (1,-1), (2,0)], # ㅓ
         [(0,0), (0,1), (0,2), (1,1)],  # ㅜ
         [(0,0), (1,0), (1,-1), (2,-1)],
         [(0,0), (0,1), (1,1), (1,2)],
         [(0,0), (1,0), (1,-1), (1,-2)],
         [(0,0), (1,0), (0,1), (0,2)],
         [(0,0), (0,1), (1,0), (2,0)],
         [(0,0), (0,1), (1,1), (2,1)]]

# 실행
max_sum = 0
for row in range(R):
    for col in range(C):
        # 해당 위치에서 블록들 13개 시도
        for b in block:
            status = True
            nums = 0
            # 4개가 경계에 걸리지 않는지 확인
            for bb in b:
                # 경계 벗어나면 > 이 블록 그냥 하지마
                if not in_range(row+ bb[0], col + bb[1]):
                    status = False
                    break
                # 경계 안이면 > 숫자 더해
                nums += arr[row+bb[0]][col+bb[1]]

            # 4개 다 되면: 최대인지 확인해
            if status:
                max_sum = max(nums, max_sum)

print(max_sum)