
''' 민트 초코 우유 / 20260923 / 체감 난이도 : 골드 5
소요 시간: 4h+ / 시도: 3회 / 실행 시간: 432ms (코드트리) / 메모리: 25MB

[타임라인]
09:00 - 09:42 (42분) 구상
09:42 - 11:27 (33분) 구현 완료, 테케는 다 맞음
11:37 - 12:02 (25분) 검증. 이때 input 잘못 받고 있는거 알아냄, 1차 제출 > fail
12:02 - 12:38 (36분) set 초기화할 때 같은 객체 참조하고 있음 알아냄, 수정 > fail
12:38 - 12:45 (7분) 뭔가 set 참조 때문일거라는 믿음이 있었으나 시간 다 지남


[구상]
- 메두사 다음으로 풀어서 그런가 전형적인 시뮬레이션이라고 느꼈다.

- 일단 input이 문자열이라 당황함. 구상 단계에서 가장 많이 고민했던 부분이다.
문자열로 들어오는 인풋을 어떻게 관리하지?
아무래도 숫자로 하는게 익숙하니까 바꾸려고 했는데, 내가 생각했던 방법들은 다음과 같다.
1. 민트 1, 초코 2, 우유 3, 민트우유 4, 민트초코 3, 초코우유 5, 민트초코우유 6으로 하기.
    이유: 이러면 1개짜리 재료들 더했을 때 각각의 숫자와 들어맞음.
    문제점: 민트초코도 3, 우유도 3임. & 전파 대상에게 없는 음식 넣어줄 때 케이스 분기 많이 해야함 > 기각
2. 민트1, 초코2, 우유3 / 민우10, 민초20, 초우30 / 민초우100
    이유: 중복되는 숫자 없이 구분 가능.
    문제점: 이것 또한 케이스 분류 너무 많이 해야함 > 기각

결국 문자열 그대로 사용하기로 결정헀다.

- set을 선택한 이유
1. 일단 전파할 때 상대방 칸에 내가 가진 알파벳이 있나 탐색해야 함.
    in 연산을 해야겠지 > 리스트보다 set이 시간 덜 걸림
2. 전파 성공해서 상대방한테 내 알파벳 줄 때 구분 안하고 그냥 다 넣어줘도 됨
    왜냐면 set은 중복 알아서 제거해주니까. AB 있는 애한테 ABC 넣어도 알아서 ABC가 되어줌.
(중간에 리스트로 할걸 후회하긴 함)


- 애매했던 점: 그룹이 단 1명이어도 그룹인가?
이거 문제에서 분명 '인접 학생과 신봉 음식이 ""완전히 같은 경우에만"" 그룹 형성'이라고 했는데
왜 1명도 그룹으로 쳐주는건지?? 표현에 문제가 있는 것 같다. 경우에"만"이라며
다만 테케 lover로써 그냥 1명도 그룹에 포함시켜줬다.


[구현]
- 미친 나 자신. 또 문제에서 4x4 줬다고 input도 4개로 받음. 뭐냐
12시에 동시제출 하기로 해서 기다리고 있었는데 11시 56분에 문득 N=1일 때 어떻게 될까? 싶어서
테케 만들어서 해봤는데 런타임 오류 나서 깜짝 놀람

- set을 주 자료형으로 쓰는건 처음이라서 불안헀다. 그래서 임시 파일에 내가 하려는 모든 연산을
가능한지 다 확인하면서 구현했다. 그래서 평소보다 구현이 좀 느렸음.


[디버깅]
- 12시까지 시간 남아서 디버그 프린트 써봄. print랑 뭐가 다른지 사실 잘 모르겠음


[첫 제출 때 놓친 것]
오직 하나. ********** set 참조 *************
1. 강한 전파 할 때
arr[me_r][me_c] = arr[other_r][other_c] 해버림
-> 이러면 둘이 같은 객체 참조하게 됨

2. 약한 전파 할 때 참조 잘못됨
(자세히 쓰자면, 각 그룹당 대표 정보를 리스트에 담아서 다음 함수로 넘기도록 구현했는데
이때 리스트의 요소로 set을 그대로 넣어줌. arr[r][c] 그대로 넣음.
근데 넣어준 [r][c]는 대표자(B) 본인도 아니고 그룹 탐색 시작한 사람(A) 좌표였음.

그 결과 뒤의 함수에서 A가 전파를 당해서 초기화하고 바꾸는 경우가 있을 수 있는데,
이 경우 내가 넣어준 대표자 정보도 바뀜. set을 그대로 넣었기 때문임.
그러면 나중에 실제로 A의 그룹짱인 B가 전파할 차례에, B는 갑자기
본인이 바뀌지도 않았는데 변심한 A의 음식으로 가짜 전도를 하고 다니게 됨!!!!!!!!!!!!!)

생각해보니 리스트 안의 요소로 arr[전파자 행][전파자 열] 했으면 문제가 없었네...
상식적인 코드를 짭시다. 왜 arr[r][c]로 했을까르?? 뒤에는 다 대표자 정보로 했음서..

---------------------------------------------------------
[후기]
이번 문제 풀이에서의 패착은 익숙하지 않은 것들을 많이 쓴 것이라고 생각함
주요 자료형이 set이고, 문자열을 계속 들고가서...
but. 이제 익숙해졌죠?

> 문자열 다루는 법 좀 더 익히도록
> set을 포함한 모든 깊은 복사, 얕은 복사, 참조 개념 다시 공부

결론: 진짜 이거 지금 틀려서 다행이다.........................................

'''


# 각 책상엔 한 명의 학생이 앉아있다. > 안 앉은 경우는 없다
# 민트 T / 초코 C / 우유 M 중 하나만 추앙
# 다른 사람에게 영향을 받아 초코우유/민트우유/민트초코/민트초코우유파가 생길 수 있다
# 초기 신앙심을 가진다.

# [1] 아침
# 모든 학생 신앙심 +1 얻는다

# [2] 점심
# 인접한 학생(상하좌우)과 신봉 음식이 '완전 같은 경우' 그룹 형성
# 그룹 내 대표자 선정: 신앙심이 큰 > 행이 작은 > 열이 작은
# 대표자를 제외한 그룹원들은 신앙심을 1씩 대표자에게 넘긴다
# > 0이 되는 사람도 있나? 없음

# [3] 저녁
# 모든 그룹의 대표자들이 신앙 전파
# 단일 > 이중 > 삼중 조합 순으로
# 같은 조합 내에서는 대표자 신앙심 높은 > 대표자 행 작은 > 대표자 열 작은 순으로

# 대표자는 본인의 신앙심 중 1만 남기고 나머지(B-1)를 간절함으로 바꿔서 전파에 사용
# 전파 방향: B%4 (B는 신앙심)로 결정
# 전파할 방향으로 한 칸씩 이동하면서 전파 시도
# 범위 밖, 간절함 0이면 전파 종료
# 신봉 음식이 완전 같으면 그냥 패스
# 신봉 음식이 다르면 전파 진행 > 신앙심 비교
# 전파를 결국 아무한테도 안해도 대표자의 신앙심 다 사라짐

# 전파자가 높을 때: 강한 전파
# 전파 대상은 동일한 음식을 신봉하게 된다
# 전파자는 전파 대상+1만큼 깎이고, 전파 대상의 신앙심 1 증가
# 이때 전파자의 간절함이 0이 될 수 있음 > 전파 종료

# 전파자가 같거나 낮을 때: 약한 전파
# 전파 대상은 전파자가 전파한 음식의 '기본 음식'에도 관심을 가지게 된다
# 즉, 기존에 관심을 가지던 음식 + 전파 받은 음식을 신봉하게 된다
# 이 경우 전파자의 간절함 0 되고 전파 종료
# 대상의 신앙심은 x만큼 증가

# 전파를 당한 학생은 그 즉시 방어 상태 > 전파를 하지 않는다
# 대표자도 전파 당할 수 있는건가봄
# 방어 상태에서 전파를 받는건 가능

# 구할 것: 민초우/민초/민우/초우/우/초/민 신봉자들의 신앙심 총합 구하기 (일자마다)

# 그룹이 1명일 수 있는가
# 인접 학생과 신봉 음식이 '완전히 같은 경우에만' 그룹 형성 >> 혼자는 안된다는 것으로 일단 간주
# ㄴ>> 테케 보니까 혼자도 됨
# ==========================================================
from collections import deque

# 범위
def in_range(nr,nc):
    return 0<=nr<N and 0<=nc<N


# 점심
def lunch():
    visit = [[0]*N for _ in range(N)]
    zzang_lst = []  # 각 그룹의 대표자 정보 넣을 리스트

    for r in range(N):
        for c in range(N):
            # 이미 그룹에 포함된 곳이면 패스
            if visit[r][c]:
                continue

            # 그룹 만들기 시작합니다
            Q = deque([[r,c]])
            visit[r][c] = 1
            my_food = food[r][c]  # 현재 그룹의 음식
            my_group = [(r, c)]  # 그룹원들 전부 좌표
            zzang = (like[r][c], -r, -c)    # 대표자 정보

            while Q:
                sr, sc = Q.popleft()

                for k in range(4):
                    nr,nc = sr+dr[k], sc+dc[k]

                    # 범위, 방문 확인
                    if not in_range(nr,nc) or visit[nr][nc]:
                        continue
                    # 같은 음식인지 확인
                    if food[nr][nc] != my_food:
                        continue
                    # 큐/그룹 리스트에 추가, 방문 표시, 대표자 갱신
                    Q.append([nr,nc])
                    visit[nr][nc] = 1
                    my_group.append((nr, nc))
                    zzang = max(zzang, (like[nr][nc], -nr, -nc))

            # # 본좌는 그룹이 한 명이면 그룹이 아닌걸로 믿고 있음 > 헐 아니네
            # if len(my_group) == 1:
            #     continue

            # 다 끝나면 짱리스트에 대표자 추가, 신앙심 바쳐라
            for row, col in my_group:
                if not (row == -zzang[1] and col == -zzang[2]):
                    like[row][col] -= 1
                    like[-zzang[1]][-zzang[2]] += 1
            zzang_lst.append((len(my_food), like[-zzang[1]][-zzang[2]], -zzang[1], -zzang[2]))
    return zzang_lst


# 저녁 함수
def dinner():
    visit = [[0]*N for _ in range(N)]   # 전파 당한 사람 표시

    for people in zzang_lst:
        _, believe, row, col = people
        my_food = food[row][col]
        # 전파 당한 사람은 전파를 못함
        if visit[row][col]:
            continue

        # 전파자의 신앙심 중 1만 남기고 간절함으로 바꾸기
        please = believe-1   # 간절함
        like[row][col] = 1

        # 전파할 방향 정하기
        my_dir = believe%4

        # 전파할 방향으로 가능할 때까지 이동하라
        sr, sc = row, col
        while True:
            nr, nc = sr+dr[my_dir], sc+dc[my_dir]

            # 이동했는데 범위 밖 > 끝
            if not in_range(nr,nc):
                break
            # 전파 대상이 나와 음식이 같음 > 패스
            if food[nr][nc] == my_food:
                sr, sc = nr, nc
                continue

            # 전파 대상이 나와 음식이 다름
            # 강한 전파
            # 전파 대상 음식 바꾸고, 전파자 간절함 깎기, 전파 대상 신앙심 1 증가
            if like[nr][nc] < please:
                food[nr][nc] = set()
                for f in my_food:
                    food[nr][nc].add(f)
                please -= (like[nr][nc] + 1)
                like[nr][nc] += 1
                visit[nr][nc] = 1
                sr, sc = nr, nc

            # 약한 전파
            else:
                for f in my_food:
                    # 전파당하는 사람한테 없는 음식 넣어주기
                    if f in food[nr][nc]:
                        continue
                    food[nr][nc].add(f)
                # 전파자 간절함 0, 전파 당한 사람 처리
                like[nr][nc] += please
                please = 0
                visit[nr][nc] = 1
                sr, sc = nr, nc

            # 전파자의 간절함 남아있는지 확인
            if please <= 0:
                break


# 정산 함수
def jungsan():
    for r in range(N):
        for c in range(N):
            # 1. 단일 음식
            if len(food[r][c])==1:
                # 민트
                if 'T' in food[r][c]:
                    point[6] += like[r][c]
                # 초코
                elif 'C' in food[r][c]:
                    point[5] += like[r][c]
                # 우유
                elif 'M' in food[r][c]:
                    point[4] += like[r][c]

            # 2. 이중 조합
            elif len(food[r][c])==2:
                # 민초
                if 'T' in food[r][c] and 'C' in food[r][c]:
                    point[1] += like[r][c]
                # 민우
                elif 'T' in food[r][c] and 'M' in food[r][c]:
                    point[2] += like[r][c]
                # 초우
                elif 'C' in food[r][c] and 'M' in food[r][c]:
                    point[3] += like[r][c]

            # 3. 삼중 조합
            elif len(food[r][c])==3:
                point[0] += like[r][c]


######################################
N, T = map(int, input().split())
food = [[set() for _ in range(N)] for _ in range(N)]
for r in range(N):
    a = input().strip()
    c = 0
    for k in a:
        food[r][c].add(k)
        c+=1
like = [list(map(int, input().split())) for _ in range(N)]

# 상하좌우
dr = [-1,1,0,0]
dc = [0,0,-1,1]


## 실행부
for _ in range(T):

    # [0] 매 턴 필요한 요소
    point = [0, 0, 0, 0, 0, 0, 0]  # [민초우,민초,민우,초우,우,초,민] 스코어

    # [1] 아침: 모든 학생 신앙심 +1
    for r in range(N):
        for c in range(N):
            like[r][c] += 1

    # [2] 점심: 그룹 형성 & 대표자 선정
    zzang_lst = lunch()
    # 대표자 리스트 우선순위에 따라 정렬
    zzang_lst.sort(key = lambda x : (x[0], -x[1], x[2], x[3]))

    # [3] 저녁
    dinner()

    # [4] 출력
    jungsan()
    print(*point)
