
''' 이상한 체스 / 20260825 / 체감 난이도 : 골드 4
소요 시간: 2시간 37분 / 시도: 1회 / 실행 시간: 176ms (코드트리) / 메모리: 26MB

[타임라인]
# 13:37 - 13:50(13분) 문제 읽기 / 구상
# 13:50 - 14:40(50분) 구현 고군분투 중
# 14:45 - 14:54(9분) 전체적인 구현 완료
# 14:54 - 15:35(41분) 디버깅 및 수정하다가 시간 끝남
# 19:55 - 20:32(37분) 저녁 먹고 돌아와서 코드 다듬고 제출 > 성공

[구상]
- (good)
    - 문제를 보면서 백트래킹이라는 생각이 바로 들었고 생각난 방법에 따라 구현했을 때 시간초과가
    나오지 않을지에 대해 고민한 점. 일단 이 문제는 n,m 크기가 작고 말의 개수도 최대 8개였기 때문에
    가능할 거라고 판단했다.
- (bad)
    - 아니 근데.. 문제가 어려워질 수록 구상에 한계가.. 그니까 뭘 해야할지 알겠는데
    어떻게 해나가야 할지 기출 풀면서 처음으로 막혔던 것 같다..
        -> 많이 풀어보고 익숙한 리스트랑 배열만 쓰지 말고 다양한 것들 다 해봐야지 뭐
    - 엣지 케이스에 대해 생각을 안해본 점
        -> 루틴에 추가: 확인할 엣지 케이스 리스트 만들고, 검증이 아닌 구상 단계에서 확인하기

[구현]
- (good)
    - 일단 성공한 것으로 만족한다.. 어떻게든 풀어보겠다는 마인드로 딕셔너리도 비효율적으로(?)
    생성하고 deepcopy 이거 정말 쓰고 싶지 않았지만.. 아무튼 써서 성공은 했다는 점
- (bad)
    - 구현이 너무 느림!!!!!!!!! 답답시러움
    오늘 막혔던 곳: assign 함수 만들기. 완성하고 나서 보면 되게 간단한데 애초에 구상 단계에서
    이 함수를 만들어야겠다라는 생각을 못했었기 때문에 만드는 중간에 계속 헤맸다. 튜플 인덱싱도 그렇고
    오히려 백트래킹 부분은 그동안 고생 많이 해서 그런지 금방 완성했음


[후기]
    - 딕셔너리, enumerate 등등 내가 외면(?)해왔던 요소들 적극 활용하기.
    아니 공부를 해도 문제에 직접 적용해본 적이 없으니까 막상 하려니 잘 안됨.
    오늘처럼 다소 비효율이더라도 딕셔너리 활용하려고 고군분투 해본 경험 좋은 것 같다.

     - 나의 능력치 한계로 구상에서 미제 사건이 발생하기 시작한다..

     - - ** 계속 내가 알고 있는 체스 룰이랑 헷갈림 **
    문제를 신생아 마인드로 받아들여야 하는데 계속 원래 체스 룰에 따랐을 때 말이 갈 수 있는 곳들이
    자연스럽게 생각나서 이미 정답인 코드 다 만들어놨는데 마지막에 문제에서 주어진 테케를 다시 봤더니
    갑자기 틀린 것 같이 느껴짐. 뭐하는겨

---------------------------------------------------------

[개선할 사항]
-코드 깔끔하게 만들기: 딕셔너리 수정, deepcopy 안하기, 불필요한 변수 선언 줄이기
-다른 풀이도 보기

176ms, 26MB -> 69ms, 17MB로 개선됨
'''
# =======================================================

# 각각의 말이 바라보는 방향 독립적으로 설정할 수 있다
# 목표: 갈 수 없는 격자의 크기 최소화
# 규칙: 본인의 말은 뛰어넘어서 지나갈 수 있음 / 상대편 말은 뛰어넘을 수 없음
# / 계산할 때 상대편 말이 있는 곳은 제외 / 상대편 말이 있는 곳까지는 가능
# 말들은 이미 배치되어 있고, 그 상태에서 못 가는 영역을 최소화하기.


## 입력 받기
N, M = map(int, input().split())    # NxM 체스판
arr = [list(map(int, input().split())) for _ in range(N)]

# 일단 상하좌우
di = [-1,1,0,0]
dj = [0,0,-1,1]

# 필요한 자료 생성
visit = [[0]*M for _ in range(N)]   # 지나갈 수 있는 곳 표시

mal_cnt = 0     # 본인의 말 개수
lst = []        # 본인의 말이 존재하는 곳의 좌표
six_cnt = 0     # 상대방 말의 개수
for x in range(N):
    for y in range(M):
        if 0 < arr[x][y] <= 5:
            mal_cnt += 1
            lst.append((x,y))
        if arr[x][y] == 6:
            six_cnt +=1

# 체스 말 종류마다 가능한 방향 넣어두기
dir_dict = {
    1 : [(0,), (1,), (2,), (3,)],
    2 : [(0, 1), (2, 3)],
    3 : [(0, 3), (3, 1), (1, 2), (2, 0)],
    4 : [(2,0,3), (0,3,1), (3,1,2), (0,2,1)],
    5 : [(0,1,2,3)]
}


# 함수: 체스 종류와 방향을 선택했을 때 갈 수 있는 곳을 visit에 표시하고,
# 처리된 visit을 백트래킹에서 되돌리기 위한 좌표 리스트 반환
def assign(si, sj, chess_num, direction):      # (시작좌표, 체스 번호, 방향)

    changed = []    # visit 되돌리기 위한 리스트

    # 말이 위치한 칸 처리
    if visit[si][sj] == 0:
        visit[si][sj] = 1
        changed.append((si, sj))

    # 갈 수 있는 방향들 순차적으로 탐색하면서
    for d in dir_dict[chess_num][direction]:
        ni, nj = si, sj
        while True:
            ni += di[d]
            nj += dj[d]

            # 범위 벗어나면 / 상대편 말 만나면 종료
            if not (0 <= ni < N and 0 <= nj < M) or arr[ni][nj] == 6:
                break

            # 갈 수 있는 곳이면
            if visit[ni][nj] == 0:
                visit[ni][nj] = 1
                changed.append((ni, nj))
    return changed

## 시작: 백트래킹
max_color = -float('inf')
def btrk(idx, color):
    global max_color

    # 종료: 내가 가진 모든 말에 대해 선택 완료
    if idx == mal_cnt:
        max_color = max(max_color, color)
        return

    # 선택: 리스트에 있는 좌표를 하나씩 꺼내서, 해당 말의 방향을 하나씩 선택
    chess_num = arr[lst[idx][0]][lst[idx][1]]

    # 해당 체스가 할 수 있는 모든 방향에 대해 카운트 세기
    for k in range(len(dir_dict[chess_num])):

        changed = assign(lst[idx][0], lst[idx][1], chess_num, k)
        btrk(idx+1, color+len(changed))

        # visit 원상복구
        for i, j in changed:
            visit[i][j] = 0

btrk(0, 0)
print(N*M - max_color - six_cnt)



