
''' 전투로봇 / 20260824 / 체감 난이도 : 골드 4
소요 시간: 2시간 30분 / 시도: 2회 / 실행 시간: 60ms (코드트리) / 메모리: 17MB

[타임라인]
# 15:36 - 15:47(11분) 문제 읽기 / 구상
# 15:47 - 16:13(26분) 전체적인 코딩 완료
# 16:13 - 16:28(15분) 디버깅, 점검 후 제출 > fail
# 16:28~ 왜 오답인지 계속 찾다가 시간 끝남

[구현]
- (good)
    - 사실 방향 틀린거 말고는 실수 없이 구현해서 나름 만족
- (bad)
    - 좀 느리다. Q에 append할 때 ([[]]) 써야되는 것도 매번 실수 함.
    기본적인 자료형 다루는데 있어서 버벅대는 일은 없도록 노력합시다
    - 차라리 효율을 덜 따져서 죽일 수 있는 모든 몬스터를 다 찾은 다음에 우선순위 계산했으면
    편하게 구현했을 것 같음. 효율 vs 편의성..

[디버깅]
- (good)
    - pprint, 기능 단위로 확인 등등.. 지금까지 풀어왔던 문제들 중 가장 많은 방식의
    디버깅을 시도했다. 확실히 중간에 print해서 확인하는게 잘 보인다. 내 실수 빼고 다 잘보인다..
- (bad)
    - 사실 디버깅으로 확인했을 때 내가 틀렸을거라 의심되었던 부분이 행/열 순서이긴 했다.
    근데 머리로 굴려봤을 때 틀리지 않았다고 생각이 들어서.. 아니 심지어 90번 이동해서 죽이는거
    전부 다 프린트해서 확인함. 근데 집중력 떨어져서 중간에 놓친 듯 하다...
     그냥 지호님처럼 작은 엣지를 직접 만들어서 확인했다면 어땠을까 ㅜㅜ 눈 아픔

[후기]
    - 작은 엣지를 만들어서 확인해보는 연습을 많이 합시다
    - 저번 과정평가 백두산에서도 행열 순서로 하는거 나왔었는데 그때도 오늘이랑 똑같이 생각해서
    테케 딱 1개 틀렸었음. 이참에 다시 풀어봐야겠다 앞으로 행/열 순서로 틀리면 나 자신을 용서하지 않겠다

---------------------------------------------------------
엣지 케이스 by 지호리:
4
0 0 0 0
0 1 9 1
1 0 0 0
0 0 0 0
-> (1,1), (1,3), (2,0)순서로 먹어야하는데
틀린 코드에서는 (1,1), (2,0), (1,3)로 먹음
-> 상좌우하로 한다고 행열 순서가 보장되는게 아니다!!!!!!!!!!!!!!!!!!!!!!!!!!!
---------------------------------------------------------
[개선할 사항]
# heapq 활용한 풀이 해보기
# 몬스터 발견했을 때 그 거리의 몬스터까지만 BFS 하고싶음 >> 근데 그냥 전부 BFS하는게 더 구현하긴 쉬움
# 조금 더 깔끔하게 하기. global 변수가 너무 많다..

# 60ms (처음 제출) > 54ms (작업 분리) > 49ms (heapq 사용)
'''
# =======================================================
# heapq
# 우선순위: 거리 > 행 > 열이니까 힙에 (거리, 행, 열) 형태로 넣으면
# 자동으로 우선순위가 정해진다

# 입력
import heapq

n = int(input().strip())
arr = [list(map(int, input().split())) for _ in range(n)]

di = [-1,0,0,1]
dj = [0,-1,1,0]

# bfs 함수: 가장 가까운 몬스터 찾으면 값을 반환
def bfs(si, sj):
    global level

    Q = []
    heapq.heappush(Q, (0, si, sj))  # (거리, 행, 열)

    visit = [[-1]*n for _ in range(n)]
    visit[si][sj] = 0

    while Q:
        dist, i, j = heapq.heappop(Q)

        # 가장 가까운, 행열 순서 빠른 몬스터 찾으면 바로 함수 종료
        if 0 < arr[i][j] < level:
            return i, j, dist

        for k in range(4):
            ni, nj = i + di[k], j + dj[k]

            if not (0 <= ni < n and 0 <= nj < n):
                continue
            if visit[ni][nj] != -1:
                continue
            if arr[ni][nj] > level:
                continue

            # 위의 경우들이 아니면 지나갈 수 있음
            visit[ni][nj] = visit[i][j] + 1
            heapq.heappush(Q, (visit[ni][nj], ni, nj))
    return

# 시작 위치 찾기
for i in range(n):
    for j in range(n):
        if arr[i][j] == 9:
            si, sj = i, j
            arr[i][j] = 0
level = 2
kill = 0
tot_time = 0
while True:
    result = bfs(si, sj)

    if result is None:
        break   # 완전 종료

    si, sj, dist = result
    arr[si][sj] = 0
    kill += 1
    tot_time += dist

    if kill == level:
        level += 1
        kill = 0
print(tot_time)