
''' 나무 타이쿤 / 20260819 / 체감 난이도 : 실버 3
소요 시간: 56분 / 시도: 1회 / 실행 시간: 101ms (코드트리) / 메모리: 19MB

[타임라인]
16:18 - 16:31 (13분) 문제 읽기 / 구상
16:31 - 16:50 (20분) 구현 완료
16:50 - 17:05 (15분) 디버깅하면서 문제 발견. 문제 다시 읽고 대각선 방향 잘못 적었음을 발견하고 수정.
17:05 - 17:14 (9분) 1번 테케는 맞는데 다른 테케는 계속 틀려서 뭐가 문제인지 고민.
                    테케가 너무 크고 디버깅도 어려워서 고민
                    각 단계 완료 후 그 다음 단계 진행해야 된다는 것을 알아내고 수정 > 성공

[구상]
- (good)
    - 어떤 자료형 쓸지 결정하고, 대략적인 코드의 뼈대를 직접 손코딩해서 구상했다.
    - 구상하는 시간이 아깝지 않다 라고 생각하려고 일부러 1분 멍떄리다 시작함
- (bad)
    - 어제 선배릠들의 말을 들어보니 조금 더 자세히 구상해야 한다고 한다. 구상 시간도 너무 짧다고 함.
    나중 가면 변수가 너무 많아지니까 지금부터 미리 더 세세하게 구상하는 연습을 할 것.

[구현]
- (good)
    - 문제에서 지정해준 단계 그대로 구현했다. 그랬더니 디버깅하면서 중간 중간에 확인하기도 훨씬 쉬웠다.
    - 송희님이 알려준 배열 요소들의 전체합 구하기 바로 써먹음
- (bad)
    - 단계가 이렇게 명확히 정해져있는데 함수로 처리할 생각을 해봤다면 어땠을까

[후기]
    - 문제 자체에서 단계를 딱 나눠서 알려줘서 쉬웠다.
    - 이전에 틀렸던 문제로부터 얻은 교훈을 잘 써먹었던 것 같다.
        ex) 어린왕자 인덱스 처리, for문 위치, queue 등 처리 순서 다시 생각하기, 문제 다시 보기 등
    - 그래서 미리 많이 틀려두는 것도 좋을 것 같다 ^^..
    - 디버깅 어떻게 했는지 조원들한테 물어볼 것

---------------------------------------------------------
[개선할 사항]
# 송's 피드백) 필요없는 변수 선언은 지양하기: frst, cur_i, cur_j, coord
# 함수 선언 풀이 나도 해보기

실행시간 101ms > 98ms
'''
# =======================================================

from collections import deque

# 0. 입력 받기
n, m = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(n)]

# 8방향 (문제에서 준 대로) > 이걸로 4방향도 처리 가능
di = [0,-1,-1,-1,0,1,1,1]
dj = [1,1,0,-1,-1,-1,0,1]

# 초기 설정
q = deque([[n-2, 0], [n-2, 1], [n-1, 0], [n-1, 1]])

# 시작
for _ in range(m):
    direction, length = map(int, input().split())
    direction -= 1      # 1~8번이므로 인덱스 맞춰주기

    # 1. 이동 규칙에 따라 이동시킨다
    for i in range(len(q)):
        q[i][0], q[i][1] = (q[i][0] + di[direction]*length)%n, (q[i][1] + dj[direction]*length)%n

        # 2. 해당 칸의 나무의 길이 +1
        arr[q[i][0]][q[i][1]] += 1

    # 3. 인접한 대각선 확인
    for si, sj in q:
        for k in range(4):
            ni, nj = si + di[2*k+1], sj + dj[2*k+1]

            # 범위 안에 있고 나무가 있으면 +1
            if 0 <= ni < n and 0 <= nj < n:
                if arr[ni][nj] != 0:
                    arr[si][sj] += 1

    # 4. 높이 2 이상인 곳 2만큼 잘라내고 영양제 올리기
    s = len(q)
    for x in range(n):
        for y in range(n):

            # q에 없던 곳이면서 높이 2 이상이면 > 길이 자르고 push
            if [x,y] not in q and arr[x][y] >= 2:
                arr[x][y] -= 2
                q.append([x, y])

    # 기존에 영양제 있던 위치 모두 삭제
    for _ in range(s):
        q.popleft()

print(sum(map(sum, arr)))