''' 자율주행 자동차 / 20260818 / 체감 난이도 : 골드 5 (난 정말 티어를 가늠을 못하겠다)
소요 시간: 2시간 10분 / 시도: 2회 / 실행 시간: 51ms (코드트리) / 메모리: 17MB

[타임라인]
문제 읽기 및 구상 (10분) - 1차 구현(26분) - 검증, 코드 정리 (17분) - 디버깅 (40분) - 실패
실패 후 3시간 뒤 다시 시도 - 일부 뒤엎기, 재구현 (20분) - 성공

[구상]
- (very bad)
    - 애초에 문제를 제대로 읽지 않아 처음부터 방향을 잘못 잡았다. 왼쪽으로 돌린 다음에 확인하는건데, 확인 후 왼쪽으로 돌렸다..
    - 문제 자체가 후진할 때에만 정지조건이 걸리기 때문에 위의 조건을 알지 못하면 디버깅을 수행해도 문제를 파악하기가 어려웠다.
    - 저녁 시간 보내고 돌아와서 다시 문제부터 읽으니까 바로 보이던데 ㅡ,,ㅡ 문제 좀 읽으라고

[구현]
- (bad)
    - 디버깅을 해도 문제가 뭔지 잘 모르면 문제를 다시 살펴보기도 해야하는데, 계속 디버깅만 했다.
- (good)
    - 어떤 순서로 코드를 짜야할지 주석으로 미리 정리해둔 뒤 작성한 것.
    - 게임의 룰이 개인적으로 어려웠는데, 주석으로 순서대로 정리해둬서 그나마 작성할 수 있었다.

[후기]
    - 문제를 읽고 이해하는 시간이 오래 걸리는 것에 나도 모르게 부담을 느끼고 있었다는 걸 깨달았다.
    - 문제에 나와있는 테케들 만큼은 꼭 이해하고 넘어갈 것.
    - ** 문제를 완벽히 이해하기 전까진 아무것도 시작하려고 하지도 말자 **
    - 변수 처리하는 순서에서 실수를 많이 하는데 처리 순서 명확히 정해놓고 코드 구현하기
        (ex: 과정평가 3 명함돌리기)
    - bfs로 푼 분들도 있던데 전혀 생각하지 못했다.. 코드 참고해서 bfs로도 풀어봐야겠다.

'''
# ======================================================
# 1. 왼쪽으로 간 적 없으면 좌회전해서 그 방향으로 1칸 전진
# 2. 왼쪽이 인도 / 이미 방문한 도로이면 다시 좌회전하고 1번
# 3. 2번 과정을 4방향에 대해 했으나 전진 못했으면 현재 방향에서 한 칸 후진하고 1번
# 4. 3번 과정에서 후진도 못하면 끝

# 구할 것: 방문한 도로의 총 면적

# [1] 입력 받기
n, m = map(int, input().split())    # n x m 도로
x, y, d = map(int, input().split())     # 초기위치, 방향
arr = [list(map(int, input().split())) for _ in range(n)]   # 도로 상태

# [2] 필요한 세팅

# 방향 (북동남서)
di = [-1,0,1,0]
dj = [0,1,0,-1]

cnt = 1     # 거쳐간 도로의 총 면적
fail_cnt = 0
visit = [[0]*m for _ in range(n)]   # 방문한 도로 표시
visit[x][y] = 1

# [3] 시작
status = True
while status:
    # 좌회전 먼저!!
    d -= 1

    # 회전한 방향으로 다음 칸 갈 수 있는가?
    ni, nj = x + di[d%4], y + dj[d%4]

    # 갈 수 있을 때
    if arr[ni][nj] == 0 and visit[ni][nj] == 0:
        x, y = ni, nj
        visit[x][y] = 1
        cnt += 1
        fail_cnt = 0

    # 갈 수 없을 때
    else:
        fail_cnt += 1

    # 4방향 모두 확인했으나 못 간 경우 > 후진
    if fail_cnt == 4:
        fail_cnt = 0
        back_x, back_y = x - di[d%4], y - dj[d%4]

        if arr[back_x][back_y] == 1:
            status = False
            break
        x, y = back_x, back_y

print(cnt)