''' 방화벽 설치하기 / 20260818 / 체감 난이도 : 실버 1
소요 시간: 1시간 30분 / 시도: 1회 / 실행 시간: 371ms (코드트리) / 메모리: 23MB

[타임라인]
15:41 - 15:51 (10분) 문제 읽기 / 구상
15:51 - 16:20 (29분) 2차원 배열에서 3개 고르는 조합 백트래킹으로 구현하려다 실패
16:20 - 16:25 (5분) 뒤쪽 bfs 먼저 구현
16:25 - 16:46 (21분) 다시 조합 백트래킹 구현 시도, 성공
16:46 - 16:59 (13분) 코드 1차 완성
17:00 - 17:10 (10분) 디버깅 진행. bfs 함수에서 잘못된 부분 수정, 마지막 출력 부분 수정

[구상]
- (bad)
    - 조합 찾는 코드 짜는데만 너무 오래 걸렸다. 기본적인 건데..,, 머하니??
    - 문제가 직관적이어서 괜찮았지만 나름 익숙한 유형이라 문제를 대충 읽지 않았나 하는 생각이 지금 든다

[구현]
- (bad)
    - 너무 구상한 순서대로 코드를 정직하게 짜려다보니 한 번에 통합해서 해도 되는 작업들을 굳이 나눠서 코드에 작성했다.
        ex. 리스트를 굳이 각각 순회하면서 0이나 1 찾기 >> 이런 것들은 애초에 구상 단계에서 한 번에 정할 수 있지 않았나
    - 결론은 코드가 너무 비효율적이다. 조금 더 자세하게 어떤 자료구조를 활용해서 구현할지 정하고 시작해야 할 것 같다.
        근데 어느 정도까지 정하고 난 뒤에 코드를 짜야하는건지 아직 잘 모르겠다..
        다른 사람들은 어느 시점에서 시작하는지 많이 참고할 것

- (good)
    - 처음에 의도한 대로 아무튼 코드를 짜긴 했다. 오래 걸리고 비효율적인 코드라서 그렇지
    - 조합 코드가 아무리 해도 안돼서 잠시 뒤쪽 코드 부분 완성하고 다시 돌아온 것?? 사실 no good임. 맘에 안들음
    - 어떻게든 문제 풀려고 발버둥 쳐본 것 같다.. deepcopy까지 쓰고 정말 쥐어짜기 식으로 푼 느낌이다 이런 경험도 쌓는거지 뭐

[후기]
    - 맘에 안들음.
    - 최소한 내가 구상한 걸 구현력이 딸려서 못 푸는 일은 없었으면 좋겠다
    - 백트래킹 안에서 bfs 쓰기 / queue에 모든 시작점 위치 넣어두고 bfs 돌리기 등 조금 변형된 형태도 그냥 문제풀 때 도전하기!
        너무 정직하게 백트래킹 따로, bfs 따로 돌리려니 일단 나도 힘들고 컴퓨터도 힘들다

---------------------------------------------------------
[개선할 사항]
# 1. llst에 모든 조합 저장하지 말고, 조합 하나를 고르는 순간 바로 방화벽 > bfs > 방화벽 취소
# 2. deepcopy도 하지 말고 잠깐 방화벽 했다가 bfs 끝나면 복구
# 3. 처음부터 모든 불의 위치를 큐에 넣고 한번에 시작 (다중시작점 BFS라고 한다더라)
# 4. 마지막에 벽 개수 셀 필요가 없다
# 5. bfs 들여쓰기 > 3번씩 돌리고 있다

실행시간 1191ms > 371ms
'''
# =======================================================
from collections import deque

# 0. 입력받기
n, m = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(n)]

# 1. 방화벽 세울 수 있는 곳 / 불 있는 곳 인덱스 저장하기
lst = []    # 빈칸인 곳
flst = []   # 불 있는 곳

for x in range(n):
    for y in range(m):
        if arr[x][y] == 0:
            lst.append([x,y])
        if arr[x][y] == 2:
            flst.append([x,y])


# 2-1. bfs 함수 정의: flst로부터 시작한 불이 어디까지 번지는지 센다
# 상하좌우
di = [-1,1,0,0]
dj = [0,0,-1,1]

def bfs(arr):
    cnt = 0  # 총 불의 개수
    visit = [[0] * m for _ in range(n)]

    # flst에 있는 모든 불을 한번에 넣고 시작
    for start_x, start_y in flst:
        visit[start_x][start_y] = 1
        q = deque()
        q.append((start_x, start_y))

        while q:
            cur_x, cur_y = q.popleft()
            for k in range(4):
                ni, nj = cur_x + di[k], cur_y + dj[k]

                if 0 <= ni < n and 0 <= nj < m:
                    if arr[ni][nj] == 0 and visit[ni][nj] == 0:
                        visit[ni][nj] = 1
                        cnt += 1
                        q.append((ni, nj))
    return cnt

# 2-2. 함수 : 방화벽 세울 3군데 정하면 bfs를 돌려서 바로 구한다.
ans = float('inf')
def choose(idx, selected):
    global ans
    # 종료: 3개 위치 골랐을 때
    if len(selected) == 3:

        # 해당 위치에 방화벽 세운 뒤에 bfs 실행
        for wall in selected:
            arr[wall[0]][wall[1]] = 1
        ans = min(ans, bfs(arr))

        # 다시 되돌리기
        for wall in selected:
            arr[wall[0]][wall[1]] = 0

        return ans

    # 방화벽 세울 위치 고르기
    for k in range(idx, len(lst)):
        choose(k + 1, selected + [lst[k]])

choose(0, [])

# 3. 불이 퍼지지 않는 영역 크기 구하기
# ans: 퍼진 불의 총 개수이므로, 빈칸을 모아둔 lst의 길이에서 ans와 3을 뺴주면 된다
print(len(lst)-ans-3)