
''' 테트리스 블럭 안의 합 최대화 하기 / 20260819 / 체감 난이도 : 실버 3
소요 시간: 2시간 3분 / 시도: 4회 / 실행 시간: 111ms (코드트리) / 메모리: 19MB

[타임라인]
14:36 - 14:51 (15분) 문제 읽기 / 구상
14:51 - 15:15 (24분) 구상할 때 bfs로 하려다가 백트래킹으로 변경, 백트래킹 부분까지 구현 완료
15:15 - 15:44 (29분) 구현 완료, 제출 > fail
15:46 - 16:04 (18분) 백트래킹 부분에서 무언가 잘못됨을 인지하였으나 못 찾고 있음
16:04 - 16:08 (4분) 화캉스
16:08 - 16:11 (3분) 정신차리고 백트래킹 완성, 2차 도전 > 시간 초과 (4063ms)
--나무 타이쿤 풀고 저녁 먹고 돌아옴--
18:45 - 18:58 (13분) 백트래킹 가지치기 시도 > 시간 초과 (4050ms)
18:58 - 19:04 (6분) 함수 실행 할 때마다 visit 행렬을 새로 만들고 있었다는걸 발견, 수정 > 기쁘지 않은 성공..

[구상]
- (good)
    - 테트리스 가능한 모양 전부 다 그려봤는데 이걸 하드코딩으로 할 수 있나 싶어서 백트래킹을 생각해낸 것
    - 구상하는 시간이 아깝지 않다 라고 생각하려고 일부러 남들보다 1분 늦게 시작함
- (bad)
    - 하드코딩의 길로 뛰어드는 그 기준을 모르겠다.
    거의 대부분 하드코딩 했던데 어떤 근거와 용기를 가지고 하드코딩에 뛰어들 수 있는가?? 물어봐야지

[구현]
- (good)
    - 두 함수로 나눠서 구현해서 어떤 부분에서 문제가 발생한건지 파악하기 쉬웠다
- (bad)
    - 난 그냥 백트래킹을 못함!! 어제도 백트래킹 때문에 고생했는데 오늘도 마찬가지였다 ㅡㅡ 예제 찾아서 풀어볼 것
    - 시간초과가 나버리니까 마음이 급해져서 visit 위치 잘못된 것도 안보이고 가지치기 어떻게 할지만 계속 생각했다
    - 두번째 함수 정의할 때 x, y 쓰니까 갑자기 지금까지 안그러다가 행/열 헷갈리는 사건 발생. 앞으로 x,y는 지양하겠음

[후기]
    - 백트래킹을 더 익힙시다.
      특히 재귀할 때 다시 돌아오면 어떻게 되는지, return 반환값 처리 등 헷갈리는 부분 다시 공부
    - 시간복잡도/공간복잡도 << 이것도 구상할 때 꼭 확인하기.
    - 뭔가 이상하면 문제 다시 보고 내 코드도 아예 입력하는 부분부터 다시 보자..
    - 배열로 테트리스 모양 다 만들어서 푸는 방식 나도 해보기

---------------------------------------------------------
'''
# =======================================================

# 0. 입력받기
n, m = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(n)]

# 상하좌우
di = [-1,1,0,0]
dj = [0,0,-1,1]

# 1. 각 칸에서 상하좌우 3번 백트래킹
# 함수 정의: 각 시작점에서 상하좌우 3번 이동했을 때 숫자합 구하기
visit = [[0]*m for _ in range(n)]
max1 = 0

def tetris(move, cnt, si, sj):
    global max1

    # 종료 조건: 3번 이동했을 때
    if move == 3:
        max1 = max(max1, cnt)
        return

    # 갈 방향 선택하기
    for k in range(4):
        ni, nj = si + di[k], sj + dj[k]

        # 범위 안에 있고 방문한 적 없다면
        if 0 <= ni < n and 0 <= nj < m:
            if visit[ni][nj] == 0:

                # 해당 방향을 선택
                visit[ni][nj] = 1
                tetris(move+1, cnt+arr[ni][nj], ni, nj)
                visit[ni][nj] = 0

                # 선택 안하면? > 코드 필요 없음

#  함수 실행: 연속 블럭에서의 최댓값 구하기
for x in range(n):
    for y in range(m):
        visit[x][y] = 1
        tetris(0, arr[x][y], x, y)
        visit[x][y] = 0


# 2. 빠큐모양 처리
# 배열 만들기
yut = [((0,0), (1,0), (2,0), (1,1)),    # ㅏ
       ((1,0), (1,1), (1,2), (0,1)),    # ㅗ
       ((1,0), (0,1), (1,1), (2,1)),    # ㅓ
       ((0,0),(0,1), (0,2), (1,1))]     # ㅜ

# 배열 순회하면서 최댓값 구하기
max2 = 0
for row in range(n):
    for col in range(m):
        # 4개 모양에 대해 수행
        for blocks in range(4):
            cur_sum = 0

            # 4개 블록을 합한다
            for k in range(4):
                nr, nc = row + yut[blocks][k][0], col + yut[blocks][k][1]

                if 0 <= nr < n and 0 <= nc < m:
                    cur_sum += arr[nr][nc]

            # 합친게 기존 max보다 크면 갱신
            max2 = max(max2, cur_sum)

# 3. 1/2번 중 최대값이 정답
print(max(max1, max2))