""" 불안한 무빙워크 / 20260916 / 체감 난이도: 실버
소요 시간 28분 / 시도 2회 / 실행 시간 75ms (코드트리) / 메모리 18MB (코드트리)

예전에 풀 때 정말 힘들었던 기억이 있었어서 풀기 너무 싫었음.
근데 막상 문제 보니까 엥?? 이거 예전처럼 포인터 쓰지 않아도
그냥 리스트로 풀 수 있을 것 같은데?? 라고 생각함.
그래서 구상 단계에서 사람, 무빙워크 2개만 리스트로 쓰고, 레일 번호를 idx로 하면 되겠군
까지 생각하고 구현 시작했다.

다만 사람이 절대 n번칸 이후로 갈 일 없다는 점, 먼저 올라간 사람이 무조건 뒤쪽에서부터라는걸
알고 있었기 때문에 쉽게 구현한 면도 없지 않은 것 같다.

한번 틀린 이유는 정확히 0의 개수가 K개일 때 종료하게 구현해서.. 시간초과 나옴 쩝

"""

# [1] 무빙워크 한 칸 회전
# [2] 무빙워크에 올라간 사람 순서대로 한 칸 이동할 수 있으면 이동하기
# 이동 가능: 칸의 안정성 0보다 크고, 사람이 없을 때
# [3] 1번 칸에 사람이 없고 안정성 0보다 크면 사람 올리기
# 사람이 올라가거나 이동한 곳은 안정성 1씩 감소
# [4] 안정성 0인 칸 개수 구하고 종료 판별
# n번 칸에 사람이 위치하면 즉시 내린다
# 구할 것: 종료되었을 때 몇 번째 실험인지

# 내가 올라가자마자 안정성 0 되면?? > 노상관
# 무조건 종료된다는거지??
# =========================================

N, K = map(int, input().split())
rail = list(map(int, input().split()))
people = [0] * N

time = 1
while True:
    # 1. 무빙워크 한 칸 회전
    # rail, people 모두 이동
    rail = rail[-1:] + rail[:2 * N - 1]
    people = people[-1:] + people[:N - 1]

    # n번칸에 사람 있으면 바로 내려
    if people[N - 1] == 1:
        people[N - 1] = 0

    # 2. 무빙워크에 올라간 사람 순서대로 이동
    for idx in range(N - 2, -1, -1):
        # 사람이 있으면
        if people[idx] == 1:
            # 칸의 안정성 양수, 사람 없으면 가능
            if rail[idx + 1] > 0 and people[idx + 1] == 0:
                people[idx] = 0
                people[idx + 1] = 1
                rail[idx + 1] -= 1

    # n번칸에 사람 있으면 바로 내려
    if people[N - 1] == 1:
        people[N - 1] = 0

    # 3. 1번칸 확인 후 사람 올리기
    if rail[0] > 0 and people[0] == 0:
        people[0] = 1
        rail[0] -= 1

    # 4. 안정성 0인 곳의 개수 구하고 종료 판별
    cnt = 0
    for s in rail:
        if s == 0:
            cnt += 1
    if cnt >= K:
        print(time)
        break

    # 5. 진행해야 된다면 시간 추가
    time += 1
