
''' 불안한 무빙워크 / 20260820 / 체감 난이도 : 골드 5
소요 시간: 2시간 30분 / 시도: 2회 / 실행 시간: 79ms (코드트리) / 메모리: 18MB

[타임라인]
# 14:36 - 14:56(20분) 문제 읽기 / 구상
# 14:56 - 15:17(21분) 전체적인 뼈대 코딩 완료
# 15:17 - 15:40(23분) 디버깅, 다듬기
# 15:40 테케 다 맞아서 제출 > fail
# 15:40 - 16:07(27분) 디버깅 계속 했으나 틀린 테케 계속 틀리고 시간 끝
# 다른 문제 풀고 밥먹고 옴
# 19:16 - 20:14(58분) 디버깅 but 정말 내 코드가 완벽해보임. 뭐가 틀린건지 진짜 전혀 모르겠음
# 20:14 - 20:26(12분) 조원들에게 나의 무적의 논리를 보여줬더니 바로 허점이 들통남.
                    어느 부분이 이상한지 정도만 힌트 듣고 수정하니까 성공함

[구상]
- (good)
    - 중간에 어느 정도 구상 잡힌 것 같아서 시작하려다가 참고 조금 더 자세히 구상함.
        어떤 자료형 활용할지, 변수명 뭘로 할지 등 세세하게 정함.
- (bad)
    - 더 자세히 했다면..? 어느 정도로 자세히 해야하는지 아직도 모르겠다. 온유님의 손설계를 보러 가야겠다

[구현]
- (good)
    - 의도적으로 단계별로 나눠서 구현하려고 노력했다.
    시키는 대로 딱 4단계 진행하는 정직한 코드를 구현하고자 했다
- (bad)
    - 너무 복잡하게 생각해서 오히려 꼬였다. 사람 좌표 그냥 인덱스로 하면 되는걸 굳이 좌표 또 만들어서 관리함.
    그리고 이게 진짜 티끌 하나만 딱 고치면 정답일 것 같아서 내가 짠 코드만 무한히 들여다보게 되는데
    오히려 코드를 완전히 새로운 방향으로 바꿔봤다면 어땠을까 싶다..

[후기]
    - 아쉽다... 하지만 정말 영원히 내 코드가 틀렸던 이유를 몰랐을 것 같긴 하다
    - 다음에도 이러면 그냥 코드 싹 갈아엎기를 해보자
    - print로 디버깅하는거 다른 사람들 어떻게 하는지 직접 보여달라고 해야지

---------------------------------------------------------
[개선할 사항]
# 사람 좌표를 Q에 따로 저장하지 말고 people만 두고 관리
# (deque에 rotate라는 것이 있던데 이걸 활용한 것도 한번 해보기: q.rotate(n))

실행시간 344ms > 79ms
'''
# =======================================================

from collections import deque

# [0] 입력받기
n, k = map(int, input().split())
rail = list(map(int, input().split()))

# [1] 필요한 자료 생성
rail_idx = 0    # 항상 시작점을 가리킬 포인터
people = [0] * (2*n)  # 사람 유무, 위치 저장할 큐

## 시작
status = True
ans = 0
while status:
    # (1) 무빙워크 한 칸 회전하기
    rail_idx = (rail_idx - 1) % (2*n)
    n_idx = (rail_idx + n-1) % (2*n)

    # n번 칸에 사람이 위치하면 > 즉시 내린다
    if people[n_idx] == 1:
        people[n_idx] = 0

    # (2) 무빙워크에 올라가있는 사람 이동하기
    # 먼저 올라간 사람부터 보려면 n_idx부터 rail_idx까지 역으로 봐야한다
    for p in range(n-1, -1, -1):
        cur = (rail_idx + p) % (2*n)
        # 사람이 있으면
        if people[cur] == 1:
            # 앞 칸 확인: 사람 있는지, 안정성 0 아닌지
            nxt = (cur+1) % (2*n)
            if people[nxt] == 0 and rail[nxt] > 0:
                people[cur] = 0
                people[nxt] = 1
                rail[nxt] -= 1

        # n번 칸에 사람이 위치하면 > 즉시 내린다
        if people[n_idx] == 1:
            people[n_idx] = 0

    # (3) 1번 칸 확인하기
    if rail[rail_idx] > 0 and people[rail_idx] == 0:
        people[rail_idx] = 1
        rail[rail_idx] -= 1

    # (4) 안정성 확인하기
    cnt = 0
    for s in rail:
        if s == 0:
           cnt += 1

        if cnt == k:
            status = False
            break

    # 다 하면 카운트 더해주기
    ans += 1

print(ans)